app/controllers/students_controller.rb

  def list
    @students = []
    @nextpage = 0
    @x = params[:id].to_i
    t = Student.all.length
    i = 1
    student_numbers = -10 * (@x - 1)
    while t > 0 do
      if Student.exists?(i)
        student_numbers += 1
        t -= 1
        if student_numbers > 0
          @students = @students + [Student.find(i)]
---
SELECT "students".* FROM "students"
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 13]]

  def create
    @student = Student.new(params[:student])

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("classs", "created_at", "finall", "idd", "labb", "namee", "nameee", "projectt", "totall", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @student = Student.find(params[:id])
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "13"]]

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]